{"description": "Vous avez lu tout un tas d'articles sur les microservices avec Django, du\nNoSQL, déployés avec Chef sur un cluster openstack. Maintenant, vous avez une\nidée de comment gérer un million d'utilisateurs, un bon mal de tête, et\ntoujours aucune idée de comment commencer.\n\nVotre objectif, c’est de développer une application qui fonctionne bien :\nc’est à dire avec peu de bugs (visibles), de bonnes performances et une bonne\ndisponibilité. Sans cette base stable, la dette technique finira pas devenir\nun frein à votre réussite.\n\nOn verra déjà comment, dès le début du projet, on peut anticiper sur des\nproblèmes futurs grâce à quelques décisions et bonnes pratiques. Puis on\ns’intéressera à la vie de l’application une fois en production : comment\nassurer sa stabilité et l’ajout de fonctionnalités et comment s’en sortir en\ncas de panne. Enfin, on verra quelques techniques qui nous permettront de\nprogressivement accueillir de nouveaux utilisateurs.\n\nPython et son écosystème seront mis à contribution à chaque étape !\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.mp4", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.webm", "duration": 1716, "category": "PyCon FR 2015", "speakers": ["Martin Richard"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.ogv", "language": "French", "title": "Votre appli web et Python: de zéro au million d'utilisateurs", "summary": "C'est décidé, vous vous lancez dans un nouveau projet d'appli web et mobile.\nVous visez le million d'utilisateurs, le passage au 20h, et Xavier Niel rêvera\nde vous racheter. Maintenant, techniquement, comment faut-il s'y prendre ?\nComment s'y retrouver dans la jungle des buzzwords ? Que reprendre des\ntechniques des géants ? Qu'est-ce qui va nous servir dans l'écosystème de\nPython ?\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/001%20-%20Martin%20Richard%20-%20Votre%20appli%20web%20et%20Python:%20de%20z%C3%A9ro%20au%20million%20d'utilisateurs.mp4.jpg"}