{"description": "We're lucky with Python that we can concentrate on getting the job done and\noften don't have to worry about how fast our code runs. Those of us without\ncomputer science degrees **really** know how to appreciate this. And 9 times\nout of 10 you probably don't need to worry at all about the speed: if the\nprogram takes 10 minutes to run but saves you hours of work then it's a job\nwell done. But then there is that 10th time…\n\nBased on work done over the last couple of years with openpyxl I will show\nsome tips and tricks as to how you can approach improving performance without\nhaving to become a mathematical genius or computer whizz. There is lots of\ngood advice about performance around but it has to make sense within the\ncontext of your application: does it matter that Python loops are considered\nslow?\n\nThe talk will cover using tests and profiling to identify the areas that you\nneed to work on, stop you breaking stuff irreparably, and what things you\nmight want to research or ask about. I do promise you: the art of performance\nreally is the art of doing nothing!\n\nLa présentation sera en anglais mais je parle le français assez bien et peu\nrépondre aux questions en français ou peut-être le franglais!\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.mp4", "source_url": "http://video-pyconfr2015.paulla.asso.fr/009_-_Charlie_Clark_-_The_Art_of_Doing_Nothing_-_Using_profiling_to_speed_up_your_code.html", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.webm", "duration": 1001, "category": "PyCon FR 2015", "speakers": ["Charlie Clark"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.ogv", "language": "English", "title": "The Art of Doing Nothing – Using profiling to speed up your code", "recorded": "2015-10-17", "summary": "We're lucky with Python that we can concentrate on getting the job done and\noften don't have to worry about how fast our code runs. After all code than\nruns today will finish before faster code that runs tomorrow. But what do you\ndo when you need to make your code run faster? This talk will give you an\nintroduction into how to improve performance where you need it most.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/009%20-%20Charlie%20Clark%20-%20The%20Art%20of%20Doing%20Nothing%20-%20Using%20profiling%20to%20speed%20up%20your%20code.mp4.jpg"}