{"description": "Il est courant de vouloir générer des pages à la fois dynamiques pour le\nnavigateur et statiques imprimables pour l’archivage ou l’impression au sein\nd’une même application web. Que ce soit pour des diaporamas, des factures ou\nde longs rapports par exemple, on aimerait pouvoir profiter de l’interactivité\nsans sacrifier une pagination intelligente nécessaire aux documents\nimprimables de qualité.\n\nPython offre d’innombrables outils pour réaliser la génération de pages et de\ndocuments. Le plus dur est aujourd’hui de choisir parmi ces outils pour\nproduire les documents qui seront exploités au maximum, d’un côté par les\nnavigateurs (liens, animations, adaptation aux supports, interactivité, etc.)\net de l’autre par les clients PDF et l’impression (typographie avancée, en-\ntêtes, pieds de page, pagination, etc).\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.mp4", "source_url": "http://video-pyconfr2015.paulla.asso.fr/010_-_Guillaume_Ayoub_-_Du_site_dynamique_au_document_imprimable_en_Python.html", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.webm", "duration": 1334, "category": "PyCon FR 2015", "speakers": ["Guillaume Ayoub"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.ogv", "language": "French", "title": "Du site dynamique au document imprimable en Python", "recorded": "2015-10-17", "summary": "Sur de nombreux sites Internet, il est courant de vouloir générer à la fois\ndes pages dynamiques pour le navigateur et des documents statiques imprimables\npour l’archivage ou l’impression. Avec une utilisation astucieuse de certains\nformats et d’outils adéquats (en Python), il est possible d’obtenir un\nrésultat de qualité pour de multiples utilisations.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/010%20-%20Guillaume%20Ayoub%20-%20Du%20site%20dynamique%20au%20document%20imprimable%20en%20Python.mp4.jpg"}