{"description": "Depuis 2005, les développeurs de Mercurial profitent et abusent de Python.\nCela laisse largement assez de temps pour explorer différent aspect du langage\net découvrir de nombreuse blagues. Certaine des idées ont été de francs\nsuccès, au point d'être intégrées aux futures versions du langages, d'autre\nont été d'affreuses erreurs que nous essayons encore d'éradiquer aujourd'hui.\n\nCette présentation se concentrera sur deux aspects de la relation entre Python\net Mercurial. Nous traiterons d'abord des pièges et astuces à propos des\nperformances de Python. Puis nous étudierons les avantages et inconvénients du\nlanguage en termes de flexibilité (introspection, monkey-patching, syntaxe,\netc) dans le contexte de Mercurial.\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/017%20-%20Pierre-Yves%20David%20-%2010%20ans%20d'astuce%20et%20d'abus,%20Mercurial%20jongle%20avec%20Python.mp4", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/017%20-%20Pierre-Yves%20David%20-%2010%20ans%20d'astuce%20et%20d'abus,%20Mercurial%20jongle%20avec%20Python.webm", "duration": 1874, "category": "PyCon FR 2015", "speakers": ["Pierre-Yves David"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/017%20-%20Pierre-Yves%20David%20-%2010%20ans%20d'astuce%20et%20d'abus,%20Mercurial%20jongle%20avec%20Python.ogv", "language": "French", "title": "10 ans d'astuce et d'abus, Mercurial jongle avec Python", "summary": "Depuis 10 ans, le logiciel Mercurial utilise, profite et abuse du language\nPython. Nous vous proposons une rétrospective des piégés dans lequel nous\nsommes tombé, des petits trucs pour améliorer nos performance et de toute les\nastuces pythonesques qui nous ont donner plus de flexibilité.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/017%20-%20Pierre-Yves%20David%20-%2010%20ans%20d'astuce%20et%20d'abus,%20Mercurial%20jongle%20avec%20Python.mp4.jpg"}