{"description": "La boucle. Un pilier de la programation impérative. Et pourtant, les\nutilisateurs avertis de Numpy l'évite comme la peste pour des raisons de\nperformance. Heureusement, Numpy fournit de bonnes abstractions piur s'en\npasser dans pas mal de cas.\n\nLe but de cette présentation est de montrer que le compilateur Pythran, un\ncompilateur statique pour un langage embarqué dans le couple Python / Numpy et\nspécialisé pour le code scientifique, est compatible avec cette approche, et\nqu'il en bénéficie même pour générer du code plus efficace que s'il n'avait eu\nque les boucles à disposition.\n\nOn tordra ainsi le cou à un vieil adage qui dit que plus on est explicite dans\nsa description de l'algorithme, plus on saura tirer des perfs. En pratique, si\non souhaite rester au niveau Python - Pythran est 100% retro-compatible Python\n- rester à haut niveau n'est pas un frein.\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.mp4", "source_url": "http://video-pyconfr2015.paulla.asso.fr/022_-_serge_sans_paille,_pierrick_brunet_-_We_dont_need_your_loops.html", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.webm", "duration": 1382, "category": "PyCon FR 2015", "speakers": ["serge sans_paille", "pierrick brunet"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.ogv", "language": "French", "title": "We don't need your loops", "recorded": "2015-10-18", "summary": "Pythran est un compilateur pour le Python scientifique qui se distingue par\ndes performances importantes pour du code de haut niveau.\n\nCette présentation se concentre sur les boucles, ou plutôt l'absence de boucle\ndans les codes numériques, pourquoi on les évite, ce que ça apporte, et\npourquoi ce n'est pas si grave de les utiliser.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/022%20-%20serge%20sans_paille,%20pierrick%20brunet%20-%20We%20don't%20need%20your%20loops.mp4.jpg"}