{"description": "Les projets de grande échelle comme OpenStack, intégrant plus d'une centaine\nde contributions par jour en moyenne, ne pourraient aboutir sans un contrôle\nrigoureux de la qualité du code. C'est pourquoi l'une des tâches majeures des\ndéveloppeurs principaux (\"core devs\") d'OpenStack est de passer en revue les\ncontributions (\"code review\") puis d'éventuellement les valider pour\nintégration au code source. Mais comment gérer un tel flux de contributions en\nun temps raisonnable ? Comment être certain qu'une contribution acceptée par\nun core dev ne va pas avoir des effets de bord sur une autre contribution\nacceptée simultanément par quelqu'un d'autre, ou sur un projet connexe ?\n\nLa communauté OpenStack utilise un outil codé en Python appelé Zuul (en\nréférence à Ghostbusters) pour répondre à ces problématiques, et permettre aux\ncore devs de ne pas avoir à consacrer 100% de leur activité à la revue de\ncode. L'intérêt de Zuul est clair pour tout projet, quel que soit son\nenvergure, nécessitant un contrôle rigoureux pour l'intégration et le\ndéploiement continus. Nous présentons donc ici les principales fonctionnalités\nde Zuul à travers des cas d'usage simples, et telles que nous les utilisons\ndans le projet [Software Factory](http://softwarefactory.enovance.com\n\"Software Factory\" ), une suite logicielle libre \"all in one\" de gestion de\ncode, poussé par Red Hat.\n\nNous couvrirons les sujets suivants:\n\n  * Comment Zuul interagit avec Gerrit, le service de revue du code\n  * Que signifie la notion de \"pipelines\" dans Zuul, et comment les utiliser\n  * Quelle stratégie suit Zuul pour gérer la queue des contributions à tester ou à intégrer\n  * Comment Zuul gère les interdépendances de projets\n  * Exemples de workflows de CI et CD facilités par Zuul\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.mp4", "source_url": "http://video-pyconfr2015.paulla.asso.fr/109_-_Matthieu_Huin,_Fabien_Boucher_-_Optimiser_lintegration_de_code_avec_Zuul.html", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.webm", "duration": 1582, "category": "PyCon FR 2015", "speakers": ["Matthieu Huin", "Fabien Boucher"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.ogv", "language": "French", "title": "Optimiser l'intégration de code avec Zuul", "recorded": "2015-10-17", "summary": "Cette présentation s'adresse à tout développeur soucieux de la qualité du\ncode, intéressé par les problématiques d'intégration et de développement\ncontinus, et travaillant sur un projet comptant plus de 2 contributeurs. Elle\nse concentre sur Zuul, un système de \"gating\" des contributions à un ensemble\nde projets.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/109%20-%20Matthieu%20Huin,%20Fabien%20Boucher%20-%20Optimiser%20l'int%C3%A9gration%20de%20code%20avec%20Zuul.mp4.jpg"}