{"description": "**SymPy.physics.mechanics** et **SymPy.physics.vector**, modules de la bibliothèque symbolique SymPy, contiennent de nombreuses classes et méthodes de mécanique classique (cinématique, manipulations vectorielles, solides et points matériels, approches variationnelles, espace de configuration, etc.). Ces deux modules constituent le noyau de PyDy (Multibody Dynamics) qui est un outil combinant à la fois NumPy, SciPy et IPython en fournissant des méthodes et techniques pour l’enseignement, la recherche en physique, la cinématique en robotique, la navigation des vaisseaux spatiaux et des machines de fabrications pour l'industrie.\n\nPour un développeur d'application scientifique , un étudiant ou un chercheur,\nles avantages sont nombreux : l'accessibilité des sources. L'approche\nsymbolique et numérique rend le calcul beaucoup plus facile pour de nombreux\nsystèmes dynamiques. Les avantages pédagogiques sont aussi nombreux : il sera\négalement l'occasion de voir que, en apprenant SymPy, Numpy et Scipy, on\napprend l'algorithmique numérique et Python. Cette présentation montrera la\nfacilité de modéliser des systèmes dynamiques à partir d'exemples concrets.\nSymPy permettant de tout connecter, PyDy, une boite à outil incluent du code\npour la simulation et la visualisation, IPython notebook interagissent pour la\npublication des données et du code.\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/115%20-%20K.I.A%20Derouiche%20-%20Pendule%20m%C3%A9canique,%20inertie,%20mouvements%20de%20robot:%20une%20mod%C3%A9lisation%20de%20la%20m%C3%A9canique%20avec%20SymPy.mp4", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/115%20-%20K.I.A%20Derouiche%20-%20Pendule%20m%C3%A9canique,%20inertie,%20mouvements%20de%20robot:%20une%20mod%C3%A9lisation%20de%20la%20m%C3%A9canique%20avec%20SymPy.webm", "duration": 2066, "category": "PyCon FR 2015", "speakers": ["K.I.A Derouiche"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/115%20-%20K.I.A%20Derouiche%20-%20Pendule%20m%C3%A9canique,%20inertie,%20mouvements%20de%20robot:%20une%20mod%C3%A9lisation%20de%20la%20m%C3%A9canique%20avec%20SymPy.ogv", "language": "French", "title": "Pendule mécanique,  inertie, mouvements de robot: une modélisation de la mécanique avec SymPy", "summary": "Dans cet exposé, nous parlerons et présenterons sympy.physics.mechanics et\nsympy.physics.vector deux modules de la bibliothèque symbolique SymPy et PyDy\n(Multibody Dynamics) ensembles d'outils fournissant des méthodes et techniques\npour l’enseignement et la recherche en physique,le contrôle optimal et\nl'ingénierie.Quelques exemples concrets d'utilisation vous seront présentés.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/115%20-%20K.I.A%20Derouiche%20-%20Pendule%20m%C3%A9canique,%20inertie,%20mouvements%20de%20robot:%20une%20mod%C3%A9lisation%20de%20la%20m%C3%A9canique%20avec%20SymPy.mp4.jpg"}