{"description": "Bokor est un logiciel libre (GPL v3) développé par la SCOP Bearstech en\npartenariat avec la société de distribution de films Cinego. Bokor est un\nframework permettant la distribution de fichiers sur un parc hétérogène de\nmachines. L'architecture est hybride, un maître coordonne un ensemble\nd'esclaves qui vont partager des fichiers en point à point, avec le protocole\nBitTorrent. Pour le distributeur, la bande passante est optimisée, et la\nrésiliance du système maitrisée. La participation autoritaire aux échanges\nBitTorrent garantie des latences optimisées. Il est en production avec\naujourd'hui 400 cinémas connectés, 10 super seeders en datacenter et 400\nfilms, bandes-annonces et courts-métrages partagés.\n\nBokor utilise Rtorrent (avec des corrections pour Cygwin) et OpenTracker (avec\nquelques patchs), pour la partie BitTorrent. Pour la partie coordination,\nPython est utilisé, essentiellement pour des appels de fonctions dynamiques.\nNous allons vous présenter la partie \"Appel de procédure distante\" (RPC en VO)\nde Bokor. Le système de RPC de Bokor a dû être conçu de manière extensible, la\nliste des fonctionnalités requises n'étant pas connue à l'avance. Nous avons\nchoisi une approche minimaliste, pour ne pas avoir de soucis de portabilité,\net pour limiter au maximum la consommation en CPU et bande-passante, qui\nseront utilisés par les très gourmands échanges BitTorrent.\n\nL'utilisation des bibliothèques tiers a été réduite au maximum, seul py-curl a\nsurvécu, préférant l'approche \"fourni avec des piles\" de Python. Par contre,\nl'introspection de python a été poussée dans ces derniers retranchements :\ndécorateurs de classes, de fonctions, modifications à chaud de classes,\nd'objets, méthodes abstraites...\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.mp4", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.webm", "duration": 1182, "category": "PyCon FR 2015", "speakers": ["Olivier André"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.ogv", "language": "French", "title": "Bokor: distribution de films en BitTorrent et hacking python", "summary": "Bokor est un logiciel libre (GPL v3) développé par la SCOP Bearstech en\npartenariat avec la société de distribution de films Cinego. Bokor est un\nframework permettant la distribution de fichiers sur un parc hétérogène de\nmachines. L'architecture est hybride, un maître coordonne un ensemble\nd'esclaves qui vont partager des fichiers en point à point, avec le protocole\nBitTorrent.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/205%20-%20Olivier%20Andr%C3%A9%20-%20Bokor:%20distribution%20de%20films%20en%20BitTorrent%20et%20hacking%20python.mp4.jpg"}