{"description": "Depuis 2 ans, le mot containeur a remplacé cloud sur les buzzometres de la\npresse informatique. néanmoins, le vrai changement ne viens pas des\ncontaineurs eux mêmes (qui datent facile d'il y a 10 ans ou plus), mais de\nl'impact sur le déploiement des applications et la facilitation des\narchitectures à base de microservices.\n\nAvec la popularisation de Docker est venu le besoin de combler tout les\nmanques du logiciel notamment en terme de déploiement et d'orchestration, via\ndes outils comme kubernetes, mesos, fig ou atomic-app. Cette présentation\nparleras donc des concepts sous jacents, de l'impact pour les admins et les\ncodeurs python de tout type, et dans quel cas est ce que fait sens de mettre\nen place ce genre de déploiement.\n\nLes exemples tourneront surtout autour de la pile docker/kubernetes/origin\n/atomic-app mais les alternatives ne seront pas oubliés et présentés aussi.\n\n", "video_mp4_url": "http://video-pyconfr2015.paulla.asso.fr/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.mp4", "video_webm_url": "http://video-pyconfr2015.paulla.asso.fr/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.webm", "duration": 1388, "category": "PyCon FR 2015", "speakers": ["Michael Scherer"], "video_ogv_url": "http://video-pyconfr2015.paulla.asso.fr/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.ogv", "language": "French", "title": "Déploiement d'applications python dans un monde post-docker", "summary": "Durant cette présentation, nous verrons comment la montée en popularité des\ncontaineurs (comme Docker, RunC, Rkt, Warden, etc) change le fonctionnement\ndes services de PaaS via l'intégration de orchestrateurs comme Kubernetes ou\nMesos, et l'impact pour les développeurs python aussi bien que les\nadministrateurs systèmes ayant déployé ce genre de systémes chez eux.\n\n", "state": 2, "thumbnail_url": "http://video-pyconfr2015.paulla.asso.fr/208%20-%20Michael%20Scherer%20-%20D%C3%A9ploiement%20d'applications%20python%20dans%20un%20monde%20post-docker.mp4.jpg"}